#
# プロットで線形モデルと比較するために、線形モデルを解く
# 単独では動かないディープパラメーター（dparam）と定常状態（ss）の定義が必要
#

#
# 以下、linsol.jlほぼそのまんま
#

# Equation indices

eq_1   = 1  #** (2.1) on \hat{y}(t) **/
eq_2   = 2  #** (2.1) on \hat{pi}(t) **/
eq_3   = 3  #** (2.1) on \hat{R}(t) **/
eq_4   = 4  #** \hat{y}(t-1) **/
eq_5   = 5  #** \hat{g} process **/
eq_6   = 6  #** \hat{z} process **/
eq_7   = 7  #** \hat{y} expectational error **/
eq_8   = 8  #** \hat{pi} expectational error **/

# Variable indices

y_t    = 1
pi_t   = 2
R_t    = 3
y1_t   = 4
g_t    = 5
z_t    = 6
Ey_t1  = 7
Epi_t1 = 8

# Expectation error indices (eta)

ey_sh  = 1
epi_sh = 2

# Shock indices (eps)

z_sh = 1
g_sh = 2
R_sh = 3

# SUMMARY

neq  = 8
neta = 2
neps = 3

# /** initialize matrices **/

GAM0 = matrix(0, neq, neq)
GAM1 = matrix(0, neq, neq)
C = matrix(0, neq, 1)
PSI = matrix(0, neq, neps)
PPI = matrix(0, neq, neta)

attach(dparam)

# =========================================================================
#                 EQUILIBRIUM CONDITIONS: CANONICAL SYSTEM
# =========================================================================

# =========================================================================
#          1.
# =========================================================================

GAM0[eq_1,y_t] =  1
GAM0[eq_1,R_t] =  1/tau
GAM0[eq_1,g_t] = -(1-rho_g)
GAM0[eq_1,z_t] = -rho_z/tau
GAM0[eq_1,Ey_t1] = -1
GAM0[eq_1,Epi_t1] = -1/tau

# =========================================================================
#          2.
# =========================================================================

GAM0[eq_2,y_t] = -kappa;
GAM0[eq_2,pi_t] = 1;
GAM0[eq_2,g_t] =  kappa;
GAM0[eq_2,Epi_t1] = -beta;

# =========================================================================
#          3.
# =========================================================================

GAM0[eq_3,y_t] = -(1-rho_R)*psi_2
GAM0[eq_3,pi_t] = -(1-rho_R)*psi_1
GAM0[eq_3,R_t] = 1
GAM0[eq_3,g_t] = (1-rho_R)*psi_2
GAM1[eq_3,R_t] = rho_R
PSI[eq_3,R_sh] = 1

# =========================================================================
#          4.
# =========================================================================

GAM0[eq_4,y1_t] = 1
GAM1[eq_4,y_t] = 1

# =========================================================================
#          5.
# =========================================================================

GAM0[eq_5,g_t] = 1
GAM1[eq_5,g_t] = rho_g
PSI[eq_5,g_sh] = 1

# =========================================================================
#          6.
# =========================================================================

GAM0[eq_6,z_t] = 1
GAM1[eq_6,z_t] = rho_z
PSI[eq_6,z_sh] = 1

# =========================================================================
#          7.
# =========================================================================

GAM0[eq_7,y_t] = 1
GAM1[eq_7,Ey_t1] = 1
PPI[eq_7,ey_sh] = 1

# =========================================================================
#          8.
# =========================================================================

GAM0[eq_8,pi_t] = 1
GAM1[eq_8,Epi_t1] = 1
PPI[eq_8,epi_sh] = 1

detach(dparam)


# =========================================================================
#            QZ(generalized Schur) decomposition by GENSYS
# =========================================================================

#
# Sims御大謹製ソルバーを呼び出す
#

# 依存しているパッケージのインストールチェック
if(!any(suppressWarnings(library(quietly=TRUE, verbose=FALSE)$results[,"Package"] == "QZ"))){
	stop("Do install.package(\"QZ\") before runnning this script.")
}
library(QZ)

# R CMD build前の状態のパッケージになっている？ので、必要なファイルだけコピーしている。
source("Sims/qzswitch.R")
source("Sims/qzdiv.R")
source("Sims/gensys.R")

r_gensys <- gensys(GAM0,GAM1,C,PSI,PPI)

